from PIL import Image

img = Image.open('./charas.png')
width, height = img.size

charactersName = [
    ['吉塔', '日和', '茉莉', '真步', '香織', '咲戀', '千歌',
        '步未', '珠希（夏日）', '妮諾（大江戶）', 'キャル（ニューイヤー）'],
    ['怜', '禊', '茜里', '璃乃', '伊緒', '望', '真琴', '流夏', '美冬（夏日）', '雷姆', 'スズメ（ニューイヤー）'],
    ['宮子', '雪', '杏奈', '初音', '美美', '妮諾', '伊莉亞', '優衣', '忍（萬聖節）', '拉姆'],
    ['七七香', '霞', '美里', '鈴奈', '胡桃', '忍', '空花', '貪吃佩可', '宮子（萬聖節）', '愛蜜莉雅'],
    ['依里', '綾音', '鈴莓', '鈴', '惠理子', '秋乃', '珠希', '可可蘿', '美咲（萬聖節）', '鈴奈（夏日）'],
    ['真陽', '優花梨', '鏡華', '智', '栞', '碧', '純', '凱留', '千歌（聖誕節）', '伊緒（夏日）'],
    ['美冬', '靜流', '美咲', '深月', '莉瑪', '莫妮卡', '紡希', '矛依未', '胡桃（聖誕節）', '咲戀（夏日）'],
    ['亞里莎', 'カヤ', 'ネネカ', '克莉絲提娜', '貪吃佩可（夏日）', '可可蘿（夏日）',
        '鈴莓（夏日）', '凱留（夏日）', '綾音（聖誕節）', '真琴（夏日）'],
    ['日和（新年）', '優衣（新年）', '怜（新年）', '惠理子（情人節）', '靜流（情人節）',
        '安', '露', '古蕾婭', '空花（大江戶）', '香織（夏日）'],
    ['真步（夏日）', '碧（插班生）', '克蘿依', 'キョウカ（ハロウィン）',
        'ミソギ（ハロウィン）', 'ミミ（ハロウィン）', 'ルナ', 'クリスティーナ（クリスマス）', 'ノゾミ（クリスマス）', 'イリヤ（クリスマス）']
]

i, x = 0, 0
while x < height - 60:
    j, y = 0, 0
    while y < width - 60:
        fileName = f'{i}-{j}'
        if charactersName[j] and charactersName[j][i]:
            fileName = charactersName[j][i]

        newImg = img.crop((x, y, x + 60, y + 60))
        newImg.save('./' + fileName + '.png')

        j += 1
        y += 62
    i += 1
    x += 62
